# RemoveLoopAt Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData..::..RemoveLoopAt Method
IFCExtrusionData Class See Also
---
Removes the loop at the specified index.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void RemoveLoopAt(
	int index
)
```

Visual Basic
---
```text
Public Sub RemoveLoopAt ( _
	index As Integer _
)
```

Visual C++
---
```text
public:
void RemoveLoopAt(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The zero-based index of the loop to remove.
# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace